vigneshvaradaraj/STM32_PROJECTS_/IWDG_Automatic_Reset/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include "rtc.h"
#include "stm32_f429xx.h"
#include "iwdg.h"
#include "led.h"
#include "gpio_exti.h"

#define BUFF_LEN   20

#if 0
static void display_rtc_calander(void);
#endif
static void check_reset_source(void);

uint8_t time_buff[BUFF_LEN] = {0};
uint8_t date_buff[BUFF_LEN] = {0};

int hr = 0,mnt = 0,sec = 0, mon = 0, day = 0, year = 0;
uint8_t g_btn_press = 0;
int main(void)
{
    /* Loop forever
	rtc_init();
	rtc_alarm_init();
	rtc_timestamp_init();
	rtc_tamper_detect_init();
	*/

	gpio_interrupt_init();
	led_init();
	check_reset_source();
	iwdg_init();
	for(;;)
	{
		if(g_btn_press != 1)
		{
			/*Refresh IWDG down-counter to default value*/
			IWDG->KR = IWDG_KEY_RELOAD;
			led_toggle();
		}
		//display_rtc_calander();
	}
}

static void check_reset_source(void)
{
	if((RCC->CSR & RCC_CSR_IWDGRSTF) == RCC_CSR_IWDGRSTF)
	{
		/*Clear IWDG Reset flag*/
		RCC->CSR |= RCC_CSR_RMVF;

		/*Turn LED on*/
		led_on();
		while(g_btn_press != 1)
		{

		}
		g_btn_press = 0;
	}
}

#if 0
static void display_rtc_calander(void)
{
	hr = rtc_convert_bcd2bin(rtc_time_get_hour());
	mnt = rtc_convert_bcd2bin(rtc_time_get_minute());
	sec = rtc_convert_bcd2bin(rtc_time_get_second());

	mon = rtc_convert_bcd2bin(rtc_date_get_month());
	day = rtc_convert_bcd2bin(rtc_date_get_day());
	year = rtc_convert_bcd2bin(rtc_date_get_year());
}
#endif

static void alarm_callback(void)
{
	(void)0;
}
void RTC_Alarm_IRQHandler(void)
{
	/*Get alarm interrupt source enable status*/
	if((RTC->CR & CR_ALRAIE) != 0)
	{
		/*Get the pending status of the Alarm interrupt*/
		if((RTC->ISR & ISR_ALRAF) != 0)
		{
			alarm_callback();
			/*Clear the Alarm interrupt pending bit*/
			RTC->ISR &= ~ISR_INIT;
		}
	}
	/*Clear the EXIT's flag for RTC Alarm*/
	EXTI->PR |= (1U << 17U);
}

void timestamp_event_callback(void)
{
	(void)0;
}

/*Tamper pin : PC13*/
/*Press push button to trigger tamper detection*/
void tamper_callback(void)
{
	/*Deactivate the tamper*/
	/*Disable tamper detection*/
	RTC->TAFCR &= ~RTC_TAFCR_TAMP1E;
	(void)0;
}
#ifdef TIMESTAMP
void TAMP_STAMP_IRQHandler(void)
{
	/*Get timesatmp interupt source enable status*/
	if((RTC->CR & CR_TSIE) != 0)
	{
		/*Get the pending status of the timesatmp interrupt*/
		if((RTC->ISR & ISR_TSF) != 0)
		{
			timestamp_event_callback();
			/*Clear the timesatmp interrupt pending bit*/
			RTC->ISR &= ~ISR_TSF;
		}
	}
	/*Clear the EXIT's flag for RTC timestamp*/
	EXTI->PR |= (1U << 21U);
}
#else
void TAMP_STAMP_IRQHandler(void)
{
	/*Get tamper interrupt source enable status*/
	if((RTC->TAFCR & RTC_TAFCR_TAMPIE) == RTC_TAFCR_TAMPIE)
	{
		/*Get the pending status of the tamper interrupt*/
		if((RTC->ISR & RTC_ISR_TAMP1F) == RTC_ISR_TAMP1F)
		{
			tamper_callback();

			/*Clear Tamper Interrupt pending bit*/
			RTC->ISR |= ~RTC_ISR_TAMP1F;
		}
	}
	/*Clear the EXIT's flag for RTC tamper*/
	EXTI->PR |= (1U << 21U);
}
#endif

static void btn_callback(void)
{
	g_btn_press = 1;
}
void EXTI15_10_IRQHandler(void)
{
	if((EXTI->PR & EXTI_IMR_IM13) == EXTI_IMR_IM13)
	{
		EXTI->PR = EXTI_IMR_IM13;
		btn_callback();
	}
}


